Page({
  /**
   * 页面的初始数据
   */
  data: {
    listData: [
      { "col1": "菜菜", "col2": "西兰花", "col3": "001" },
      { "col1": "菜菜", "col2": "白萝卜", "col3": "002" },
      { "col1": "菜菜", "col2": "芋头", "col3": "003" },
      { "col1": "菜菜", "col2": "南瓜", "col3": "004" },
      { "col1": "菜菜", "col2": "白菜", "col3": "005" },
      { "col1": "菜菜", "col2": "菠菜", "col3": "006" },
      { "col1": "菜菜", "col2": "西红柿", "col3": "007" },
      { "col1": "菜菜", "col2": "山药", "col3": "008" },
      { "col1": "菜菜", "col2": "胡萝卜", "col3": "009" },
      { "col1": "菜菜", "col2": "青椒", "col3": "010" },
      { "col1": "菜菜", "col2": "木耳", "col3": "011" },
      { "col1": "菜菜", "col2": "土豆", "col3": "012" },
      { "col1": "菜菜", "col2": "豆腐", "col3": "013" },
      { "col1": "菜菜", "col2": "彩椒", "col3": "014" },
      { "col1": "菜菜", "col2": "洋葱", "col3": "015" },
      { "col1": "菜菜", "col2": "黄瓜", "col3": "016" },
      { "col1": "菜菜", "col2": "蔬菜粒", "col3": "017" },
      { "col1": "肉肉", "col2": "猪肉", "col3": "101" },
      { "col1": "肉肉", "col2": "羊肉", "col3": "102" },
      { "col1": "肉肉", "col2": "牛肉", "col3": "103" },
      { "col1": "肉肉", "col2": "火腿肠", "col3": "104" },
      { "col1": "肉肉", "col2": "鸡胸肉", "col3": "105" },
      { "col1": "肉肉", "col2": "鸡爪", "col3": "106" },
      { "col1": "肉肉", "col2": "鸡腿", "col3": "107" },
      { "col1": "肉肉", "col2": "鸡脖", "col3": "108" },
      { "col1": "肉肉", "col2": "排骨", "col3": "109" },
      { "col1": "肉肉", "col2": "里脊肉", "col3": "110" },
      { "col1": "调料", "col2": "盐", "col3": "201" },
      { "col1": "调料", "col2": "味素", "col3": "202" },
      { "col1": "调料", "col2": "水", "col3": "203" },
      { "col1": "调料", "col2": "姜", "col3": "204" },
      { "col1": "调料", "col2": "葱", "col3": "205" },
      { "col1": "调料", "col2": "蒜", "col3": "206" },
      { "col1": "调料", "col2": "黄酒", "col3": "207" },
      { "col1": "调料", "col2": "生抽", "col3": "208" },
      { "col1": "调料", "col2": "料酒", "col3": "209" },
      { "col1": "调料", "col2": "淀粉", "col3": "210" },
      { "col1": "调料", "col2": "老抽", "col3": "211" },
      { "col1": "调料", "col2": "陈醋", "col3": "212" },
      { "col1": "调料", "col2": "白糖", "col3": "213" },
      { "col1": "调料", "col2": "蚝油", "col3": "214" },
      { "col1": "调料", "col2": "香叶", "col3": "215" },
      { "col1": "调料", "col2": "冰糖", "col3": "216" },
      { "col1": "调料", "col2": "米醋", "col3": "217" },
      { "col1": "调料", "col2": "NULL", "col3": "218" },
      { "col1": "调料", "col2": "鸡精", "col3": "219" },
      { "col1": "调料", "col2": "孜然粉", "col3": "220" },
      { "col1": "调料", "col2": "胡椒粉", "col3": "221" },
      { "col1": "调料", "col2": "五香粉", "col3": "222" },
      { "col1": "调料", "col2": "NULL", "col3": "223" },
      { "col1": "调料", "col2": "小米辣", "col3": "224" },
      { "col1": "调料", "col2": "八角", "col3": "225" },
      { "col1": "调料", "col2": "番茄酱", "col3": "226" },
      { "col1": "蛋蛋", "col2": "鸡蛋", "col3": "301" },
      { "col1": "蛋蛋", "col2": "鹅蛋", "col3": "302" },
      { "col1": "蛋蛋", "col2": "皮蛋", "col3": "303" },
      { "col1": "生存", "col2": "快手", "col3": "401" },
      { "col1": "生存", "col2": "家常", "col3": "402" },
      { "col1": "生存", "col2": "B站", "col3": "403" },
      { "col1": "生存", "col2": "抖音", "col3": "404" },
      { "col1": "忌口", "col2": "辣", "col3": "501" },
      { "col1": "忌口", "col2": "酸", "col3": "502" },
      { "col1": "海鲜", "col2": "螃蟹", "col3": "601" }, 
      { "col1": "海鲜", "col2": "鲍鱼", "col3": "602" },
      { "col1": "海鲜", "col2": "鱿鱼", "col3": "603" }, 
      { "col1": "海鲜", "col2": "大虾", "col3": "604" },
      { "col1": "海鲜", "col2": "虾仁", "col3": "605" },
      { "col1": "辅料", "col2": "芝士", "col3": "701" },  
      { "col1": "辅料", "col2": "干辣椒", "col3": "702" }, 
      { "col1": "辅料", "col2": "豆瓣酱", "col3": "703" }, 
      { "col1": "辅料", "col2": "芝麻", "col3": "704" }, 
      { "col1": "辅料", "col2": "甜面酱", "col3": "705" }, 
      { "col1": "主食", "col2": "粥", "col3": "801" },
      { "col1": "主食", "col2": "米饭", "col3": "802" },
      { "col1": "主食", "col2": "面粉", "col3": "803" }, 
      { "col1": "主食", "col2": "油", "col3": "804" },        
      { "col1": "主食", "col2": "啤酒", "col3": "805" },               
,                                        
    ]
  },

  onShareAppMessage: function () {
    return {
     
    }
  },
  onShareTimeline: function(res){
    return {
      
    }
  },
  onPageScroll:function(){

  },

})
